read_verilog -formal mycounter-false.v
prep -top mycounter
flatten
memory -nomap
hierarchy -check
setundef -undriven -init -expose
write_btor  -s ../build/mycounter-false.btor2
