read_verilog -formal counter-false.v
prep -top counter
flatten
memory -nordff
setundef -undriven -init -expose
delete -output
techmap
abc -fast -g AND
write_aiger -zinit ../tests/encoderinput/btor2/counter-false.aig