read_verilog -formal mycounter.v
prep -top mycounter
flatten
memory -nomap
hierarchy -check
setundef -undriven -init -expose
write_btor  -s ../tests/encoder/input/btor2/m-mycounter.btor2