read_verilog -formal mycounter.v
prep -top mycounter
flatten
memory -nordff
setundef -undriven -init -expose
delete -output
techmap
abc -fast -g AND
write_aiger -zinit -ascii ../tests/encoder/input/btor2/mycounter.aag